Revit 2027 API
ExternalServices.BuiltInExternalServices.CustomFieldService Property
 Autodesk Internal: The service for updating the custom fields of a schedule.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId CustomFieldService { get; }
Public Shared ReadOnly Property CustomFieldService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ CustomFieldService {
	ExternalServiceId^ get ();
}
static member CustomFieldService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace